zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_s12ad_rx/src/targets/rx14t/r_s12ad_rx14t.c
/***********************************************************************************************************************
* Copyright (c) 2020 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_s12ad_rx14t.c
* Description  : Primary source code for 12-bit A/D Converter driver.
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description           
*           10.07.2025 1.00    Initial Release.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
/* Includes board and MCU related header files. */
#include <stdio.h>
#include "platform.h"

#if defined (BSP_MCU_RX14T)
#include "r_s12ad_rx_config.h"
#include "r_s12ad_rx_private.h"
#include "r_s12ad_rx_if.h"

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define ADC_PRV_GET_SST_ARR(x)     (((x)==0) ?  gp_sreg0_ptrs : \
                                                gp_sreg1_ptrs) 

#define ADC_PRV_LOCK(x)             (((x)==0) ? BSP_LOCK_S12AD  : \
                                                BSP_LOCK_S12AD1)

#define ADC_PRV_INVALID_CH_MASK(x)     (((x)==0) ?  ADC_PRV_INVALID_CH_MASK0 : \
                                                    ADC_PRV_INVALID_CH_MASK1)

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
/* Unit1 registers are a superset of Unit0, 1 EXCEPT that they do not contain the S&H registers */
typedef R_BSP_VOLATILE_EVENACCESS struct st_s12ad1  aregs_t;

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/

/* In RAM */
adc_ctrl_t g_dcb[2] = {{ADC_MODE_MAX,
                        NULL,
                        false},

                        {ADC_MODE_MAX,
                        NULL,
                        false}};

/* In ROM. A/D Data Register pointers */

volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg0_ptrs[ADC_REG_MAX+1] =
                    {

                        /* A/D data register */
                        &S12AD.ADDR0,       /* channel 0 */
                        &S12AD.ADDR1,       /* channel 1 */
                        &S12AD.ADDR2,       /* channel 2 */
                        &S12AD.ADDR3,       /* channel 3 */
                        &S12AD.ADDR4,       /* channel 4 */
                        &S12AD.ADDR5,       /* channel 5 */
                        &S12AD.ADDR6,       /* channel 6 */
                        &S12AD.ADDR7,       /* channel 7 */
                        NULL,
                        NULL,
                        &S12AD.ADDBLDR,     /* double trigger register */
                        &S12AD.ADDBLDRA,    /* double trigger registerA */
                        &S12AD.ADDBLDRB,    /* double trigger registerB */
                        &S12AD.ADRD.WORD    /* self-diagnosis register */
                    };

volatile uint16_t R_BSP_EVENACCESS_SFR * const  gp_dreg1_ptrs[ADC_REG_MAX+1] =
                    {

                        /* A/D data register */
                        &S12AD1.ADDR0,       /* channel 0 */
                        &S12AD1.ADDR1,       /* channel 1 */
                        &S12AD1.ADDR2,       /* channel 2 */
                        &S12AD1.ADDR3,       /* channel 3 */
                        &S12AD1.ADDR4,       /* channel 4 */
                        &S12AD1.ADDR5,       /* channel 5 */
                        &S12AD1.ADDR6,       /* channel 6 */
                        &S12AD1.ADDR7,       /* channel 7 */
                        &S12AD1.ADTSDR,      /* temperature sensor */
                        &S12AD1.ADOCDR,      /* voltage sensor */
                        &S12AD1.ADDBLDR,     /* double trigger register */
                        &S12AD1.ADDBLDRA,    /* double trigger registerA */
                        &S12AD1.ADDBLDRB,    /* double trigger registerB */
                        &S12AD1.ADRD.WORD    /* self-diagnosis register */
                    };
/* In ROM. Sample State (SST) Register pointers */

/* 8-bit register pointers */
volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg0_ptrs[ADC_SST_REG_MAX+1] =
                    {

                        /* A/D Sampling State Register */
                        &S12AD.ADSSTR0,     /* channel 0 */
                        &S12AD.ADSSTR1,     /* channel 1 */
                        &S12AD.ADSSTR2,     /* channel 2 */
                        &S12AD.ADSSTR3,     /* channel 3 */
                        &S12AD.ADSSTR4,     /* channel 4 */
                        &S12AD.ADSSTR5,     /* channel 5 */
                        &S12AD.ADSSTR6,     /* channel 6 */
                        &S12AD.ADSSTR7,     /* channel 7 */
                        NULL,
                        NULL,
                    };

volatile uint8_t R_BSP_EVENACCESS_SFR * const  gp_sreg1_ptrs[ADC_SST_REG_MAX+1] =
                    {

                        /* A/D Sampling State Register */
                        &S12AD1.ADSSTR0,     /* channel 0 */
                        &S12AD1.ADSSTR1,     /* channel 1 */
                        &S12AD1.ADSSTR2,     /* channel 2 */
                        &S12AD1.ADSSTR3,     /* channel 3 */
                        &S12AD1.ADSSTR4,     /* channel 4 */
                        &S12AD1.ADSSTR5,     /* channel 5 */
                        &S12AD1.ADSSTR6,     /* channel 6 */
                        &S12AD1.ADSSTR7,     /* channel 7 */
                        &S12AD1.ADSSTRT,     /* temperature sensor */
                        &S12AD1.ADSSTRO,     /* voltage sensor */
                    };
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_open_cfg(uint8_t            unit,
                                    adc_mode_t  const  mode,
                                    adc_cfg_t * const  p_cfg,
                                    void     (* const  p_callback)(void *p_args));

static adc_err_t adc_check_scan_config(uint8_t const unit,  adc_ch_cfg_t *p_config);
#endif

static adc_err_t adc_configure_scan(uint8_t const unit,  adc_ch_cfg_t *p_config);
static void adc_configure_sensors(adc_ch_cfg_t  *p_config);
static void adc_enable_s12adi(uint8_t unit);
static void adc_enable_s12gbadi(uint8_t unit);
static void adc_enable_s12gcadi(uint8_t unit);

R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi0_isr, VECT(S12AD,S12ADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12adi1_isr, VECT(S12AD1,S12ADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi0_isr, VECT(S12AD,GBADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gbadi1_isr, VECT(S12AD1,GBADI1))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi0_isr, VECT(S12AD,GCADI))
R_BSP_PRAGMA_STATIC_INTERRUPT(adc_s12gcadi1_isr, VECT(S12AD1,GCADI1))

