zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_s12ad_rx/src/targets/rx14t/r_s12ad_rx14t.c
/******************************************************************************
* Function Name: adc_open
* Description  : This function applies power to the A/D peripheral, sets the
*                operational mode, trigger sources, interrupt priority, and
*                configurations common to all channels and sensors. If interrupt
*                priority is non-zero, the function takes a callback function
*                pointer for notifying the user at interrupt level whenever a
*                scan has completed.
*
* Arguments    : unit -
*                    0
*                mode -
*                    Operational mode (see enumeration below)
*                p_cfg-
*                    Pointer to configuration structure (see below)
*                p_callback-
*                    Optional pointer to function called from interrupt when
*                    a scan completes
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_AD_LOCKED-
*                    Open() call is in progress elsewhere
*                ADC_ERR_AD_NOT_CLOSED-
*                    Peripheral is still running in another mode; Perform
*                    R_ADC_Close() first
*                ADC_ERR_INVALID_ARG-
*                    mode or element of p_cfg structure has invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon mode
*                ADC_ERR_MISSING_PTR-
*                    p_cfg pointer is FIT_NO_PTR/NULL
*******************************************************************************/
adc_err_t adc_open(uint8_t     const  unit,
                    adc_mode_t  const  mode,
                    adc_cfg_t * const  p_cfg,
                    void     (* const  p_callback)(void *p_args))
{
    aregs_t     *p_regs;
    volatile uint16_t   u16_dummy;  /* Dummy read for "1" change to "0".(read first) */
    volatile uint8_t    u8_dummy;   /* Dummy read for "1" change to "0".(read first) */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    volatile uint32_t   ipl_value;
#endif

#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    /* Pointer check */
    if ((NULL == p_cfg) || (FIT_NO_PTR == p_cfg))
    {
        return ADC_ERR_MISSING_PTR;
    }

    err = adc_check_open_cfg(unit, mode, p_cfg, p_callback);
    if (ADC_SUCCESS != err)
    {
        return err;
    }
#endif

    /* ENSURE OPEN() NOT ALREADY IN PROGRESS */
    if (true == g_dcb[unit].opened)
    {
        return ADC_ERR_AD_NOT_CLOSED;
    }
    if (R_BSP_HardwareLock(ADC_PRV_LOCK(unit)) == false)
    {
        return ADC_ERR_AD_LOCKED;
    }

    /* APPLY POWER TO PERIPHERAL */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    /* Interrupt_disable */
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, (void *)&ipl_value);
#endif

    /* S12AD module clock is enabled */
    if (0 == unit)
    {
        MSTP(S12AD) = 0;
    }
    else 
    {
        MSTP(S12AD1) = 0;
    }

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    /* Interrupt enable */
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, (void *)&ipl_value);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
    if (1 == unit)
    {
        /* A/D register address */
        p_regs = (aregs_t *)&S12AD1;

        /* Initialize S12AD2 register */

        /* A/D Control Register initialize */
        p_regs->ADCSR.WORD = 0;

        /* A/D Channel Select Register A0 initialize */
        p_regs->ADANSA0.WORD = 0;

        /* A/D-Converted Value Addition/Average Function Select Register 0 initialize */
        p_regs->ADADS0.WORD = 0;

        /* A/D-Converted Value Addition/Average Count Select Register initialize */
        p_regs->ADADC.BYTE = 0;

        /* A/D Control Extended Register initialize */
        p_regs->ADCER.WORD = 0;

        /* A/D Conversion Start Trigger Select Register initialize */
        p_regs->ADSTRGR.WORD = 0;

        /* A/D Channel Select Register B0 initialize */
        p_regs->ADANSB0.WORD = 0;

        /* A/D Disconnection Detection Control Register initialize */
        p_regs->ADDISCR.BYTE = 0;

        /* A/D Group Scan Priority Control Register initialize */
        p_regs->ADGSPCR.WORD = 0;

        /* A/D Channel Select Register C0 initialize */
        p_regs->ADANSC0.WORD = 0;

        /* A/D Group C Trigger Select Register initialize */
        p_regs->ADGCTRGR.BYTE = 0;

        /* A/D Sampling State Register initialize */
        p_regs->ADSSTR0  = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR1  = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR2  = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR3  = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR4  = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR5  = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR6  = ADC_SST_CNT_DEFAULT;
        p_regs->ADSSTR7  = ADC_SST_CNT_DEFAULT;

        /* A/D Conversion Extended Input Control Register initialize */
        p_regs->ADEXICR.WORD = 0;

        /* SET MODE RELATED REGISTER FIELDS */
        g_dcb[unit].mode = mode;
        if ((ADC_MODE_SS_MULTI_CH_GROUPED == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
        }
        else if ((ADC_MODE_SS_MULTI_CH_GROUPED_GROUPC == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            p_regs->ADCSR.BIT.ADCS = ADC_ADCS_GROUP_SCAN;
            p_regs->ADGCTRGR.BIT.GRCE = 1;       // Use Group C
        }
        else
        {
            if ((ADC_MODE_CONT_ONE_CH == mode) || (ADC_MODE_CONT_MULTI_CH == mode))
            {
                p_regs->ADCSR.BIT.ADCS = ADC_ADCS_CONT_SCAN;
            }

            /* other modes have ADCS=0 */
        }

        if ((ADC_MODE_SS_ONE_CH_DBLTRIG == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A == mode)
        || (ADC_MODE_SS_MULTI_CH_GROUPED_DBLTRIG_A_GROUPC == mode))
        {
            p_regs->ADCSR.BIT.DBLE = 1;         /* enable double trigger */
        }

        /* SET TRIGGER AND INTERRUPT PRIORITY REGISTER FIELDS */
        if (ADC_TRIG_SOFTWARE != p_cfg->trigger)
        {
            p_regs->ADSTRGR.BIT.TRSA = p_cfg->trigger;
        }

        if (ADC_TRIG_ASYNC_ADTRG == p_cfg->trigger)
        {
            p_regs->ADCSR.BIT.EXTRG = 1;        /* set ext trigger for async trigger */
        }

        if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
        {
            /* for Group B */
            p_regs->ADSTRGR.BIT.TRSB = p_cfg->trigger_groupb;

            /* for Group C */
            p_regs->ADGCTRGR.BIT.TRSC = p_cfg->trigger_groupc;

            /* for Group B */
            IPR(S12AD1,GBADI1) = p_cfg->priority_groupb;

            /* for Group C */
            IPR(S12AD1,GCADI1) = p_cfg->priority_groupc;
        }

