zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_s12ad_rx/src/targets/rx14t/r_s12ad_rx14t.c
       case ADC_CMD_USE_VREFL0:
            p_regs->ADHVREFCNT.BIT.LVSEL = 1;
            break;
       case ADC_CMD_SET_DDA_STATE_CNT:

            /* Disconnection Detection Assist (DDA) */
            p_charge = (adc_dda_t *)p_args;
#if (ADC_CFG_PARAM_CHECKING_ENABLE == 1)
            if (ADC_DDA_OFF != p_charge->method)
            {
                if ((p_charge->num_states < ADC_DDA_STATE_CNT_MIN)
                || (p_charge->num_states > ADC_DDA_STATE_CNT_MAX)
                || (0 != p_regs->ADCER.BIT.DIAGM))          // self-diagnosis enabled
                {
                    return ADC_ERR_ILLEGAL_ARG;
                }
            }
#endif
            if (ADC_DDA_OFF == p_charge->method)
            {
                p_regs->ADDISCR.BYTE = 0;
            }
            else
            {

                /* NOTE: Using Disconnect Detection Assist adds num_states x (#chans) ADCLKS to scan time */
                p_regs->ADDISCR.BYTE = (uint8_t)((ADC_DDA_PRECHARGE == p_charge->method) ? 0x10 : 0);
                p_regs->ADDISCR.BYTE |= p_charge->num_states;
            }
            break;

        case ADC_CMD_SET_SAMPLE_STATE_CNT:

            /* sampling state */
            p_sample = (adc_sst_t *)p_args;
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
            if ((p_sample->reg_id > ADC_SST_REG_MAX)
            || (p_sample->num_states < ADC_SST_CNT_MIN))
            {
                return ADC_ERR_INVALID_ARG;
            }
#endif
            *(ADC_PRV_GET_SST_ARR(unit))[p_sample->reg_id] = p_sample->num_states;
            break;

        case ADC_CMD_ENABLE_CHANS:

            /* Specifies the A/D conversion channel. */
            err = adc_configure_scan(unit, (adc_ch_cfg_t *)p_args);
            break;
		case ADC_CMD_ENABLE_TEMP_SENSOR:
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
            if (ADC_MODE_SS_TEMPERATURE != g_dcb[unit].mode)
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
            if (unit != 1)
            {
                return ADC_ERR_ILLEGAL_ARG;
            }
            
#endif
            S12AD1.ADEXICR.BIT.TSSA = 1;                  // select temperature sensor
            if (ADC_ADD_OFF != S12AD1.ADADC.BIT.ADC)
            {
                S12AD1.ADEXICR.BIT.TSSAD = 1;            // enable addition
            }
            IR(S12AD1,S12ADI1) = 0;                  // clear flag
            S12AD1.ADCSR.BIT.ADIE = 1;               // enable in peripheral
            if (0 != ICU.IPR[IPR_S12AD1_S12ADI1].BYTE)
            {
                R_BSP_InterruptRequestEnable(VECT(S12AD1,S12ADI1));             // enable in ICU
            }
            break;

        case ADC_CMD_ENABLE_TRIG:
            p_regs->ADCSR.BIT.TRGE = 1;            // enable sync/async triggers
            break;

        case ADC_CMD_DISABLE_TRIG:
            p_regs->ADCSR.BIT.TRGE = 0;            // disable sync/async triggers
            break;

        case ADC_CMD_SCAN_NOW:
            if (0 == p_regs->ADCSR.BIT.ADST)
            {
                p_regs->ADCSR.BIT.ADST = 1;
            }
            else
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE:           // default/Group A or Group B
            if (1 == p_regs->ADCSR.BIT.ADST) 
            {
                err = ADC_ERR_SCAN_NOT_DONE;
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPA:
            if (0 == unit)
            {
                if (1 == IR(S12AD,S12ADI))
                {
                    IR(S12AD,S12ADI) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else 
            {
                if (1 == IR(S12AD1,S12ADI1))
                {
                    IR(S12AD1,S12ADI1) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPB:
            if (0 == unit)
            {
                if (1 == IR(S12AD,GBADI))
                {
                    IR(S12AD,GBADI) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else
            {
                if (1 == IR(S12AD1,GBADI1))
                {
                    IR(S12AD1,GBADI1) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

        case ADC_CMD_CHECK_SCAN_DONE_GROUPC:
            if (0 == unit)
            {
                if (1 == IR(S12AD,GCADI))
                {
                    IR(S12AD,GCADI) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            else
            {
                if (1 == IR(S12AD1,GCADI1))
                {
                    IR(S12AD1,GCADI1) = 0;
                }
                else
                {
                    err = ADC_ERR_SCAN_NOT_DONE;
                }
            }
            break;

        case ADC_CMD_ENABLE_INT:
            p_regs->ADCSR.BIT.ADIE = 1;            // enable S12ADI0 interrupt
            break;

        case ADC_CMD_DISABLE_INT:
             p_regs->ADCSR.BIT.ADIE = 0;            // disable S12ADI0 interrupt
            break;

        case ADC_CMD_ENABLE_INT_GROUPB:
            p_regs->ADCSR.BIT.GBADIE = 1;          // enable GBADI interrupt
            break;

        case ADC_CMD_DISABLE_INT_GROUPB:
            p_regs->ADCSR.BIT.GBADIE = 0;          // disable GBADI interrupt
            break;

        case ADC_CMD_ENABLE_INT_GROUPC:
            p_regs->ADGCTRGR.BIT.GCADIE = 1;       // enable GCADI interrupt
            break;

        case ADC_CMD_DISABLE_INT_GROUPC:
            p_regs->ADGCTRGR.BIT.GCADIE = 0;       // disable GCADI interrupt
            break;

        default:
            err = ADC_ERR_INVALID_ARG;
            break;
    }

