zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_s12ad_rx/src/targets/rx14t/r_s12ad_rx14t.c
    return err;
} /* End of function adc_control() */


/******************************************************************************
* Function Name: adc_configure_scan
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode. Mask registers are
*                initialized and interrupts enabled in peripheral. Interrupts
*                are also enabled in ICU if corresponding priority is not 0.
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
static adc_err_t adc_configure_scan(uint8_t const   unit,
                                    adc_ch_cfg_t   *p_config)
{
    uint16_t    i=0;
    uint32_t    tmp_mask=0;

    aregs_t     *p_regs;
    uint16_t    trig_a;
    uint16_t    trig_b;
    uint16_t    trig_c;
    uint16_t    tmp_pgacr[ADC_PGA_CHANNEL_MAX];
    uint16_t    tmp_pgags0[ADC_PGA_CHANNEL_MAX];
    uint8_t     tmp_pgamoncr;

    /* A/D register address */
    if (0 == unit)
    {
        p_regs = (aregs_t *)&S12AD;
    }
    else
    {
        p_regs = (aregs_t *)&S12AD1;
    }
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
    adc_err_t   err;

    err = adc_check_scan_config(unit, p_config);
    if (ADC_SUCCESS != err)
    {
        return err;
    }

#endif /* parameter checking */

    /* SET MASKS FOR CHANNELS */
    p_regs->ADANSA0.WORD = (uint16_t) (p_config->chan_mask & 0x00FF);

    /* SET MASKS FOR CHANNELS */
    p_regs->ADANSB0.WORD = (uint16_t) (p_config->chan_mask_groupb & 0x00FF);

    /* SET MASKS FOR CHANNELS */
    p_regs->ADANSC0.WORD = (uint16_t) (p_config->chan_mask_groupc & 0x00FF);

    /* SET MASKS FOR CHANNELS */
    p_regs->ADADS0.WORD = (uint16_t) (p_config->add_mask & 0x00FF);

    adc_configure_sensors(p_config);
    /* Programmable Gain Amplifier setting */
	if (unit == 0)
	{
        tmp_pgamoncr = 0;
        for (i=0; i<ADC_PGA_CHANNEL_MAX; i++)    /* ch0-2 */
        {
            tmp_pgacr[i] = 0;
            tmp_pgags0[i] = 0;
            switch(p_config->signal_path_control[i])
            {
                case ADC_ANALOG_INPUT_1:
                    tmp_pgacr[i] = 0;
                    break;
                case ADC_ANALOG_INPUT_2:
                    tmp_pgacr[i] = 0;
                    break;
                case ADC_ANALOG_INPUT_3:
                    tmp_pgacr[i] = 0;
                    break;
                case ADC_PGA_DIFFERENTIAL_INPUT_1:
                    tmp_pgacr[i] = 0x4;
                    break;
                case ADC_PGA_DIFFERENTIAL_INPUT_2:
                    tmp_pgacr[i] = 0x40;
                    break;
                case ADC_PGA_DIFFERENTIAL_INPUT_3:
                    tmp_pgacr[i] = 0x400;
                    break;
                case ADC_PGA_SINGLE_END_INPUT_1:
                    tmp_pgacr[i] = 0x1004;
                    break;
                case ADC_PGA_SINGLE_END_INPUT_2:
                    tmp_pgacr[i] = 0x2040;
                    break;
                case ADC_PGA_SINGLE_END_INPUT_3:
                    tmp_pgacr[i] = 0x4400;
                    break;
                default:
                    break;
            }
            
            PGA0.PGACR.WORD = (tmp_pgacr[0] | tmp_pgacr[1] | tmp_pgacr[2]);
            switch(p_config->pga_gain[i])
            {
                case ADC_PGA_GAIN_4:
                    tmp_pgags0[i] = 0;
                    break;
                case ADC_PGA_GAIN_8:
                    tmp_pgags0[i] = 0x1;
                    break;
                case ADC_PGA_GAIN_16:
                    tmp_pgags0[i] = 0x2;
                    break;
                case ADC_PGA_GAIN_32:
                    tmp_pgags0[i] = 0x3;
                    break;
                default:
                    break;
            }
            PGA0.PGAGS0.WORD = (tmp_pgags0[0] | (tmp_pgags0[1] << 4) | (tmp_pgags0[2] << 8));
            switch(p_config->pga_monitor)
            {
                case ADC_PGA_MONITOR_0:
                     tmp_pgamoncr = 0x81;
                     break;
                case ADC_PGA_MONITOR_1:
                    tmp_pgamoncr = 0x91;
                    break;
                case ADC_PGA_MONITOR_2:
                    tmp_pgamoncr = 0xA1;
                    break;
                default:
                    break;
            }
            PGA0.PGAMONCR.BYTE = tmp_pgamoncr;
        }
        i = 0;
     }

    /* SET GROUP A PRIORITY ACTION (not interrupt priority!) */

    if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
    {
        trig_a = p_regs->ADSTRGR.BIT.TRSA;              // save TRSA
        trig_b = p_regs->ADSTRGR.BIT.TRSB;              // save TRSB
        trig_c = p_regs->ADGCTRGR.BIT.TRSC;             // save TRSC
        p_regs->ADSTRGR.BIT.TRSA = ADC_TRIG_NONE;
        p_regs->ADSTRGR.BIT.TRSB = ADC_TRIG_NONE;
        p_regs->ADGCTRGR.BIT.TRSC = ADC_TRIG_NONE;
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSA)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADSTRGR.BIT.TRSB)  // bus wait for ADSTRGR write
        {
            R_BSP_NOP();
        }
        if (ADC_TRIG_NONE != p_regs->ADGCTRGR.BIT.TRSC) // bus wait for ADGCTRGR write
        {
            R_BSP_NOP();
        }

        p_regs->ADGSPCR.WORD = p_config->priority_groupa;

        p_regs->ADSTRGR.BIT.TRSA = trig_a;              // restore TRSA

        if (0 == p_regs->ADGSPCR.BIT.GBRP)
        {
            p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
            p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
        }
        else
        {
            if (0 == p_regs->ADGCTRGR.BIT.GRCE)
            {
                p_regs->ADGCTRGR.BIT.TRSC = trig_c;  // restore TRSC
            }
            else
            {
                p_regs->ADSTRGR.BIT.TRSB = trig_b;   // restore TRSB
            }
        }
    }
    else
    {
        p_regs->ADGSPCR.WORD = p_config->priority_groupa;
    }

    /* SET SELF DIAGNOSIS REGISTERS (VIRTUAL CHANNEL) */
    if (ADC_DIAG_OFF == p_config->diag_method)
    {
        p_regs->ADCER.BIT.DIAGM = 0;
    }
    else
    {

