zephyrproject-rtos/hal_renesas/drivers/rx/rdp/src/r_s12ad_rx/src/targets/rx14t/r_s12ad_rx14t.c
        /* NOTE: Using Self Diagnosis adds 11/13/15(resolution) + (ch0 SST) ADCLKS to scan time. */
        /* (ch0 can still be used with self diagnosis on) */
        if (ADC_DIAG_ROTATE_VOLTS == p_config->diag_method)
        {
            p_regs->ADCER.BIT.DIAGLD = 0;
            p_regs->ADCER.BIT.DIAGVAL = 1;
        }
        else
        {
            p_regs->ADCER.BIT.DIAGLD = 1;

            /* 2-bit value */
            p_regs->ADCER.BIT.DIAGVAL = (uint8_t)(p_config->diag_method & 0x3);
        }
        p_regs->ADCER.BIT.DIAGM = 1;
    }

    /* SET DOUBLE TRIGGER CHANNEL */
    if (1 == p_regs->ADCSR.BIT.DBLE)
    {
        tmp_mask = p_config->chan_mask;         /* tmp_mask is non-Group/Group A chans */

        /* WAIT_LOOP */
        while (tmp_mask >>= 1)                  /* determine bit/ch number @suppress("While statement braces") */
        {
            i++;
        }
        p_regs->ADCSR.BIT.DBLANS = i;
    }

    /* ENABLE INTERRUPTS */
    adc_enable_s12adi(unit);
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        adc_enable_s12gbadi(unit);
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)
        {
            adc_enable_s12gcadi(unit);
        }
    }

    return ADC_SUCCESS;
} /* End of function adc_configure_scan() */


/******************************************************************************
* Function Name: adc_check_scan_config
* Description  : This function does extensive checking on channel mask
*                settings based upon operational mode.
*
* NOTE: A negative number is stored in two's complement form.
*       A quick way to change a binary number into two's complement is to
*       start at the right (LSB) and moving left, don't change any bits
*       until after the first "1" is reached.
*       Number          2's complement
*       0010 0110       1101 1010
*       Another way is to do a 1's complement on the number, then add 1 to that.
*       Number          1's complement  + 1
*       0010 0110       1101 1001       1101 1010
*
* Arguments    : p_config
*                    Pointer to channel config structure containing masks
* Return Value : ADC_SUCCESS-
*                    Successful
*                ADC_ERR_INVALID_ARG-
*                    reg_id contains an invalid value.
*                ADC_ERR_ILLEGAL_ARG-
*                    an argument is illegal based upon rest of configuration
*******************************************************************************/
#if ADC_CFG_PARAM_CHECKING_ENABLE == 1
static adc_err_t adc_check_scan_config(uint8_t const   unit,
                                        adc_ch_cfg_t   *p_config)
{
    uint32_t    tmp_mask=0;
    aregs_t     *p_regs;

    /* A/D register address */
    if (0 == unit)
    {
        p_regs = (aregs_t *)&S12AD;
    }
    else
    {
        p_regs = (aregs_t *)&S12AD1;
    }
    /* unit == 0 */
    INTERNAL_NOT_USED(unit);
    /* Verify at least one bonded channel is selected */
    if (0 == p_config->chan_mask)

    {
        return ADC_ERR_INVALID_ARG;
    }
    /* ADC_MASK_VOLT and ADC_MASK_TEMPis groupA only. */
    if ((ADC_MODE_SS_INT_REF_VOLT == g_dcb[unit].mode)
    || (ADC_MODE_SS_TEMPERATURE == g_dcb[unit].mode))
    {
        /* VOLT selection confirmation */
        if (0 == (p_config->chan_mask & ADC_MASK_VOLT)
        && (ADC_MODE_SS_INT_REF_VOLT == g_dcb[unit].mode))
        {
            return ADC_ERR_INVALID_ARG;
        }
        if (0 == (p_config->chan_mask & ADC_MASK_TEMP)
        && (ADC_MODE_SS_TEMPERATURE == g_dcb[unit].mode))
        {
            return ADC_ERR_INVALID_ARG;
        }
	
        /* When A/D conversion of the internal reference voltage is to be performed, set all the bits in the ADANSA0
           and ADANSB0 and ADANSC0 registers and the ADCSR.DBLE bit should be set
            to all 0 in single scan mode. */
        if ((0 != (p_config->chan_mask & 0x000000FF))          /* ADANSA0 != 0 and ADANSA1 != 0*/
        || (0 != (p_config->chan_mask_groupb & 0x000000FF))    /* ADANSB0 != 0 and ADANSB1 != 0 */
        || (0 != (p_config->chan_mask_groupc & 0x000000FF))    /* ADANSC0 != 0 and ADANSC1 != 0 */
        || (1 == p_regs->ADCSR.BIT.DBLE)        // double trigger mode
        || (1!= unit))                         // cannnot use unit0 and unit1
        {
            return ADC_ERR_INVALID_ARG;
        }
        /* Single scan mode only. */
        if (0 != p_regs->ADCSR.BIT.ADCS)
        {
            return ADC_ERR_ILLEGAL_ARG;

        }
    }

    /* Verify at least one unique bonded channel is selected for Group B
     * and GroupA priority setting is valid.
     */
    if (ADC_ADCS_GROUP_SCAN == p_regs->ADCSR.BIT.ADCS)
    {
        if ((0 == p_config->chan_mask_groupb)
            || ((p_config->chan_mask_groupc & ADC_MASK_VOLT) != 0)
			|| ((p_config->chan_mask_groupc & ADC_MASK_TEMP) != 0))
        {
        	return ADC_ERR_INVALID_ARG;
        }
        else if ((p_config->chan_mask & p_config->chan_mask_groupb) != 0)
		{
            return ADC_ERR_ILLEGAL_ARG;         // same chan in both groups
        }
        else
        {
            tmp_mask = p_config->chan_mask_groupb;
        }
        if (1 == p_regs->ADGCTRGR.BIT.GRCE)     // for Group C
        {
            if ((0 == p_config->chan_mask_groupc)
            || ((p_config->chan_mask_groupc & ADC_MASK_VOLT) != 0)
		    || ((p_config->chan_mask_groupc & ADC_MASK_TEMP)))
            {
                return ADC_ERR_INVALID_ARG;
            }
            else if (((p_config->chan_mask & p_config->chan_mask_groupb)
            || (p_config->chan_mask & p_config->chan_mask_groupc)
            || (p_config->chan_mask_groupb & p_config->chan_mask_groupc)) != 0)
            {
                return ADC_ERR_ILLEGAL_ARG;         // same chan in three groups
            }
            else
            {
                tmp_mask |= p_config->chan_mask_groupc;
            }
        }
    }
    else
    {

        /* for addition mask checking */
        if ((0 != p_config->chan_mask_groupb) || (0 != p_config->chan_mask_groupc))
        {
            return ADC_ERR_INVALID_ARG;
        }

        /* PGS bit must be set when group scan mode */
        if (ADC_GRPA_PRIORITY_OFF != p_config->priority_groupa)
        {
            return ADC_ERR_INVALID_ARG;
        }
    }

